[
  {
    "id": "e2566083-d1d6-46b7-a875-db8689979b4b",
    "title": "Project 1",
    "img": "",
    "description": "This project focuses on the advanced features and capabilities of HTML5, including multimedia integration, enhanced form controls, and improved semantic elements. It aims to demonstrate how HTML5 can be used to create modern, responsive, and accessible web applications."
  },
  {
    "id": "c2749627-254f-43b7-b779-a1de26bb4314",
    "title": "Project 2",
    "img": "",
    "description": "The project explores the innovative aspects of HTML5, such as its support for audio and video elements, canvas for drawing graphics, and new APIs for offline storage and geolocation. It showcases practical examples and best practices for leveraging HTML5 to build dynamic and interactive web experiences."
  },
  {
    "id": "666b9a03-bed9-4ab2-b619-b6adfbabdddc",
    "title": "Project 3",
    "img": "",
    "description": "This project focuses on the advanced features and capabilities of HTML5."
  },
  {
    "id": "a1b2c3d4-e5f6-7890-abcd-ef1234567890",
    "title": "Project 4",
    "img": "",
    "description": "This project demonstrates the use of CSS Grid and Flexbox for creating responsive web layouts. It includes examples of complex grid structures and flexible box models to build modern, adaptive designs."
  },
  {
    "id": "b2c3d4e5-f6a7-8901-bcde-1234567890ab",
    "title": "Project 5",
    "img": "",
    "description": "The project focuses on JavaScript ES6 features, including arrow functions, classes, modules, and promises. It provides practical examples and exercises to help developers understand and apply these new language features."
  },
  {
    "id": "c3d4e5f6-a7b8-9012-cdef-234567890abc",
    "title": "Project 6",
    "img": "",
    "description": "This project explores the capabilities of the Fetch API for making HTTP requests. It includes examples of GET, POST, PUT, and DELETE requests, as well as handling JSON responses and error handling."
  },
  {
    "id": "d4e5f6a7-b8c9-0123-def0-34567890abcd",
    "title": "Project 7",
    "img": "",
    "description": "The project showcases the use of WebSockets for real-time communication. It includes examples of setting up a WebSocket server and client, and demonstrates how to send and receive messages in real-time."
  },
  {
    "id": "e5f6a7b8-c9d0-1234-ef01-4567890abcde",
    "title": "Project 8",
    "img": "",
    "description": "This project focuses on the use of Service Workers for creating offline-first web applications. It includes examples of caching strategies, background sync, and push notifications to enhance the user experience."
  }
]
